coocox/Mplib/Toshaba/TMPM36x/TMPM369/cmsis_lib/lib/include/tmpm369_gpio.h
#define IS_GPIO_PD_FUNCTION_REG(param)  (((param) == GPIO_FUNC_REG_1))

#define IS_GPIO_PE_FUNCTION_REG(param)  (((param) == GPIO_FUNC_REG_1)|| \
                                         ((param) == GPIO_FUNC_REG_2)|| \
                                         ((param) == GPIO_FUNC_REG_3)|| \
                                         ((param) == GPIO_FUNC_REG_4)|| \
                                         ((param) == GPIO_FUNC_REG_5))

#define IS_GPIO_PF_FUNCTION_REG(param)  (((param) == GPIO_FUNC_REG_1)|| \
                                         ((param) == GPIO_FUNC_REG_2)|| \
                                         ((param) == GPIO_FUNC_REG_3)|| \
                                         ((param) == GPIO_FUNC_REG_4))

#define IS_GPIO_PG_FUNCTION_REG(param)  (((param) == GPIO_FUNC_REG_1)|| \
                                         ((param) == GPIO_FUNC_REG_2)|| \
                                         ((param) == GPIO_FUNC_REG_3)|| \
                                         ((param) == GPIO_FUNC_REG_4))

#define IS_GPIO_PH_FUNCTION_REG(param)  (((param) == GPIO_FUNC_REG_1)|| \
                                         ((param) == GPIO_FUNC_REG_2)|| \
                                         ((param) == GPIO_FUNC_REG_3)|| \
                                         ((param) == GPIO_FUNC_REG_4)|| \
                                         ((param) == GPIO_FUNC_REG_5))

#define IS_GPIO_PI_FUNCTION_REG(param)  (((param) == GPIO_FUNC_REG_1)|| \
                                         ((param) == GPIO_FUNC_REG_2))

#define IS_GPIO_PK_FUNCTION_REG(param)  (((param) == GPIO_FUNC_REG_1)|| \
                                         ((param) == GPIO_FUNC_REG_2)|| \
                                         ((param) == GPIO_FUNC_REG_3)|| \
                                         ((param) == GPIO_FUNC_REG_4))

#define IS_GPIO_PL_FUNCTION_REG(param)  (((param) == GPIO_FUNC_REG_1)|| \
                                         ((param) == GPIO_FUNC_REG_2)|| \
                                         ((param) == GPIO_FUNC_REG_3)|| \
                                         ((param) == GPIO_FUNC_REG_4)|| \
                                         ((param) == GPIO_FUNC_REG_5)|| \
                                         ((param) == GPIO_FUNC_REG_6))

#define IS_GPIO_PM_FUNCTION_REG(param)  (((param) == GPIO_FUNC_REG_1)|| \
                                         ((param) == GPIO_FUNC_REG_2))

#define IS_GPIO_PN_FUNCTION_REG(param)  (((param) == GPIO_FUNC_REG_1)|| \
                                         ((param) == GPIO_FUNC_REG_2))
/** @} */
/* End of group GPIO_Parameter_Definition */

/** @defgroup GPIO_Bit_Define
  * @{
  */
#define GPIO_BIT_VALUE_1                ((uint8_t)0x01)
#define GPIO_BIT_VALUE_0                ((uint8_t)0x00)

#define IS_GPIO_BIT_VALUE(BitValue)     (((BitValue) == GPIO_BIT_VALUE_1)|| \
                                         ((BitValue) == GPIO_BIT_VALUE_0))

#define GPIO_BIT_0                      ((uint8_t)0x01)
#define GPIO_BIT_1                      ((uint8_t)0x02)
#define GPIO_BIT_2                      ((uint8_t)0x04)
#define GPIO_BIT_3                      ((uint8_t)0x08)
#define GPIO_BIT_4                      ((uint8_t)0x10)
#define GPIO_BIT_5                      ((uint8_t)0x20)
#define GPIO_BIT_6                      ((uint8_t)0x40)
#define GPIO_BIT_7                      ((uint8_t)0x80)
#define GPIO_BIT_ALL                    ((uint8_t)0xFF)

#define GPIO_PA_OUTPUT_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PA_PULLUP_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PA_PULLDOWN_BIT_ALL                 ((uint8_t)0xFF)
#define GPIO_PA_OPEN_DRAIN_BIT_ALL               ((uint8_t)0xFF)
#define GPIO_PA_INPUT_BIT_ALL                    ((uint8_t)0xFF)
#define GPIO_PA_FR1_BIT_ALL                      ((uint8_t)0xFF)
#define GPIO_PA_FR2_BIT_ALL                      ((uint8_t)0xFF)
#define GPIO_PA_FR3_BIT_ALL                      ((uint8_t)0xE8)
#define GPIO_PA_FR4_BIT_ALL                      ((uint8_t)0x80)
#define GPIO_PA_FR5_BIT_ALL                      ((uint8_t)0x80)

#define GPIO_PB_OUTPUT_BIT_ALL                   ((uint8_t)0x7F)
#define GPIO_PB_PULLUP_BIT_ALL                   ((uint8_t)0x7F)
#define GPIO_PB_PULLDOWN_BIT_ALL                 ((uint8_t)0x7F)
#define GPIO_PB_OPEN_DRAIN_BIT_ALL               ((uint8_t)0x7F)
#define GPIO_PB_INPUT_BIT_ALL                    ((uint8_t)0x7F)
#define GPIO_PB_FR1_BIT_ALL                      ((uint8_t)0x7F)
#define GPIO_PB_FR2_BIT_ALL                      ((uint8_t)0x7C)
#define GPIO_PB_FR3_BIT_ALL                      ((uint8_t)0x3F)
#define GPIO_PB_FR4_BIT_ALL                      ((uint8_t)0x7C)

#define GPIO_PC_OUTPUT_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PC_PULLUP_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PC_PULLDOWN_BIT_ALL                 ((uint8_t)0xFF)
#define GPIO_PC_OPEN_DRAIN_BIT_ALL               ((uint8_t)0xFF)
#define GPIO_PC_INPUT_BIT_ALL                    ((uint8_t)0xFF)
#define GPIO_PC_FR1_BIT_ALL                      ((uint8_t)0xFF)
#define GPIO_PC_FR2_BIT_ALL                      ((uint8_t)0x03)

#define GPIO_PD_OUTPUT_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PD_PULLUP_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PD_PULLDOWN_BIT_ALL                 ((uint8_t)0xFF)
#define GPIO_PD_OPEN_DRAIN_BIT_ALL               ((uint8_t)0xFF)
#define GPIO_PD_INPUT_BIT_ALL                    ((uint8_t)0xFF)
#define GPIO_PD_FR1_BIT_ALL                      ((uint8_t)0xFF)

#define GPIO_PE_OUTPUT_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PE_PULLUP_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PE_PULLDOWN_BIT_ALL                 ((uint8_t)0xFF)
#define GPIO_PE_OPEN_DRAIN_BIT_ALL               ((uint8_t)0xFF)
#define GPIO_PE_INPUT_BIT_ALL                    ((uint8_t)0xFF)
#define GPIO_PE_FR1_BIT_ALL                      ((uint8_t)0x7E)
#define GPIO_PE_FR2_BIT_ALL                      ((uint8_t)0xFF)
#define GPIO_PE_FR3_BIT_ALL                      ((uint8_t)0xFF)
#define GPIO_PE_FR4_BIT_ALL                      ((uint8_t)0x9B)
#define GPIO_PE_FR5_BIT_ALL                      ((uint8_t)0x9F)

#define GPIO_PF_OUTPUT_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PF_PULLUP_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PF_PULLDOWN_BIT_ALL                 ((uint8_t)0xFF)
#define GPIO_PF_OPEN_DRAIN_BIT_ALL               ((uint8_t)0xFF)
#define GPIO_PF_INPUT_BIT_ALL                    ((uint8_t)0xFF)
#define GPIO_PF_FR1_BIT_ALL                      ((uint8_t)0xFF)
#define GPIO_PF_FR2_BIT_ALL                      ((uint8_t)0xF0)
#define GPIO_PF_FR3_BIT_ALL                      ((uint8_t)0xFF)
#define GPIO_PF_FR4_BIT_ALL                      ((uint8_t)0xE6)

#define GPIO_PG_OUTPUT_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PG_PULLUP_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PG_PULLDOWN_BIT_ALL                 ((uint8_t)0xFF)
#define GPIO_PG_OPEN_DRAIN_BIT_ALL               ((uint8_t)0xFF)
#define GPIO_PG_INPUT_BIT_ALL                    ((uint8_t)0xFF)
#define GPIO_PG_FR1_BIT_ALL                      ((uint8_t)0xFF)
#define GPIO_PG_FR2_BIT_ALL                      ((uint8_t)0xFE)
#define GPIO_PG_FR3_BIT_ALL                      ((uint8_t)0xFF)
#define GPIO_PG_FR4_BIT_ALL                      ((uint8_t)0x0C)

