coocox/Mplib/Toshaba/TMPM36x/TMPM369/cmsis_lib/lib/include/tmpm369_gpio.h
#define GPIO_PH_OUTPUT_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PH_PULLUP_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PH_PULLDOWN_BIT_ALL                 ((uint8_t)0xFF)
#define GPIO_PH_OPEN_DRAIN_BIT_ALL               ((uint8_t)0xFF)
#define GPIO_PH_INPUT_BIT_ALL                    ((uint8_t)0xFF)
#define GPIO_PH_FR1_BIT_ALL                      ((uint8_t)0xEF)
#define GPIO_PH_FR2_BIT_ALL                      ((uint8_t)0xAF)
#define GPIO_PH_FR3_BIT_ALL                      ((uint8_t)0x0F)
#define GPIO_PH_FR4_BIT_ALL                      ((uint8_t)0x0C)
#define GPIO_PH_FR5_BIT_ALL                      ((uint8_t)0x1F)

#define GPIO_PI_OUTPUT_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PI_PULLUP_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PI_PULLDOWN_BIT_ALL                 ((uint8_t)0xFF)
#define GPIO_PI_OPEN_DRAIN_BIT_ALL               ((uint8_t)0xFF)
#define GPIO_PI_INPUT_BIT_ALL                    ((uint8_t)0xFF)
#define GPIO_PI_FR1_BIT_ALL                      ((uint8_t)0x0F)
#define GPIO_PI_FR2_BIT_ALL                      ((uint8_t)0x08)

#define GPIO_PJ_OUTPUT_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PJ_PULLUP_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PJ_PULLDOWN_BIT_ALL                 ((uint8_t)0xFF)
#define GPIO_PJ_OPEN_DRAIN_BIT_ALL               ((uint8_t)0xFF)
#define GPIO_PJ_INPUT_BIT_ALL                    ((uint8_t)0xFF)

#define GPIO_PK_OUTPUT_BIT_ALL                   ((uint8_t)0x1F)
#define GPIO_PK_PULLUP_BIT_ALL                   ((uint8_t)0x1F)
#define GPIO_PK_PULLDOWN_BIT_ALL                 ((uint8_t)0x1F)
#define GPIO_PK_OPEN_DRAIN_BIT_ALL               ((uint8_t)0x1F)
#define GPIO_PK_INPUT_BIT_ALL                    ((uint8_t)0x1F)
#define GPIO_PK_FR1_BIT_ALL                      ((uint8_t)0x1F)
#define GPIO_PK_FR2_BIT_ALL                      ((uint8_t)0x1E)
#define GPIO_PK_FR3_BIT_ALL                      ((uint8_t)0x1E)
#define GPIO_PK_FR4_BIT_ALL                      ((uint8_t)0x02)

#define GPIO_PL_OUTPUT_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PL_PULLUP_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PL_PULLDOWN_BIT_ALL                 ((uint8_t)0xFF)
#define GPIO_PL_OPEN_DRAIN_BIT_ALL               ((uint8_t)0xFF)
#define GPIO_PL_INPUT_BIT_ALL                    ((uint8_t)0xFF)
#define GPIO_PL_FR1_BIT_ALL                      ((uint8_t)0xFF)
#define GPIO_PL_FR2_BIT_ALL                      ((uint8_t)0xFF)
#define GPIO_PL_FR3_BIT_ALL                      ((uint8_t)0x0F)
#define GPIO_PL_FR4_BIT_ALL                      ((uint8_t)0x0F)
#define GPIO_PL_FR5_BIT_ALL                      ((uint8_t)0x0E)
#define GPIO_PL_FR6_BIT_ALL                      ((uint8_t)0x08)

#define GPIO_PM_OUTPUT_BIT_ALL                   ((uint8_t)0x0F)
#define GPIO_PM_PULLUP_BIT_ALL                   ((uint8_t)0x0F)
#define GPIO_PM_PULLDOWN_BIT_ALL                 ((uint8_t)0x0F)
#define GPIO_PM_OPEN_DRAIN_BIT_ALL               ((uint8_t)0x0F)
#define GPIO_PM_INPUT_BIT_ALL                    ((uint8_t)0x0F)
#define GPIO_PM_FR1_BIT_ALL                      ((uint8_t)0x07)
#define GPIO_PM_FR2_BIT_ALL                      ((uint8_t)0x0F)

#define GPIO_PN_OUTPUT_BIT_ALL                   ((uint8_t)0x3F)
#define GPIO_PN_PULLUP_BIT_ALL                   ((uint8_t)0x3F)
#define GPIO_PN_PULLDOWN_BIT_ALL                 ((uint8_t)0x3F)
#define GPIO_PN_OPEN_DRAIN_BIT_ALL               ((uint8_t)0x3F)
#define GPIO_PN_INPUT_BIT_ALL                    ((uint8_t)0x3F)
#define GPIO_PN_FR1_BIT_ALL                      ((uint8_t)0x3F)
#define GPIO_PN_FR2_BIT_ALL                      ((uint8_t)0x30)

#define IS_GPIO_PA_DATA_BIT(param)      (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3)|| \
                                         ((param) == GPIO_BIT_4)|| \
                                         ((param) == GPIO_BIT_5)|| \
                                         ((param) == GPIO_BIT_6)|| \
                                         ((param) == GPIO_BIT_7))

#define IS_GPIO_PB_DATA_BIT(param)      (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3)|| \
                                         ((param) == GPIO_BIT_4)|| \
                                         ((param) == GPIO_BIT_5)|| \
                                         ((param) == GPIO_BIT_6))

#define IS_GPIO_PC_DATA_BIT(param)      (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3)|| \
                                         ((param) == GPIO_BIT_4)|| \
                                         ((param) == GPIO_BIT_5)|| \
                                         ((param) == GPIO_BIT_6)|| \
                                         ((param) == GPIO_BIT_7))

#define IS_GPIO_PD_DATA_BIT(param)      (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3)|| \
                                         ((param) == GPIO_BIT_4)|| \
                                         ((param) == GPIO_BIT_5)|| \
                                         ((param) == GPIO_BIT_6)|| \
                                         ((param) == GPIO_BIT_7))

#define IS_GPIO_PE_DATA_BIT(param)      (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3)|| \
                                         ((param) == GPIO_BIT_4)|| \
                                         ((param) == GPIO_BIT_5)|| \
                                         ((param) == GPIO_BIT_6)|| \
                                         ((param) == GPIO_BIT_7))

#define IS_GPIO_PF_DATA_BIT(param)      (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3)|| \
                                         ((param) == GPIO_BIT_4)|| \
                                         ((param) == GPIO_BIT_5)|| \
                                         ((param) == GPIO_BIT_6)|| \
                                         ((param) == GPIO_BIT_7))

