coocox/Mplib/Toshaba/TMPM36x/TMPM369/cmsis_lib/lib/include/tmpm369_gpio.h
#define IS_GPIO_PF_INPUT_BIT(param)      (((param) & GPIO_PF_INPUT_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PF_INPUT_BIT_ALL))))

#define IS_GPIO_PF_PULLDOWN_BIT(param)   (((param) & GPIO_PF_PULLDOWN_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PF_PULLDOWN_BIT_ALL))))

#define IS_GPIO_PG_OUTPUT_BIT(param)     (((param) & GPIO_PG_OUTPUT_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PG_OUTPUT_BIT_ALL))))

#define IS_GPIO_PG_FR1_BIT(param)        (((param) & GPIO_PG_FR1_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PG_FR1_BIT_ALL))))

#define IS_GPIO_PG_FR2_BIT(param)        (((param) & GPIO_PG_FR2_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PG_FR2_BIT_ALL))))

#define IS_GPIO_PG_FR3_BIT(param)        (((param) & GPIO_PG_FR3_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PG_FR3_BIT_ALL))))

#define IS_GPIO_PG_FR4_BIT(param)        (((param) & GPIO_PG_FR4_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PG_FR4_BIT_ALL))))

#define IS_GPIO_PG_OPEN_DRAIN_BIT(param) (((param) & GPIO_PG_OPEN_DRAIN_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PG_OPEN_DRAIN_BIT_ALL))))

#define IS_GPIO_PG_PULLUP_BIT(param)     (((param) & GPIO_PG_PULLUP_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PG_PULLUP_BIT_ALL))))

#define IS_GPIO_PG_INPUT_BIT(param)      (((param) & GPIO_PG_INPUT_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PG_INPUT_BIT_ALL))))

#define IS_GPIO_PG_PULLDOWN_BIT(param)   (((param) & GPIO_PG_PULLDOWN_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PG_PULLDOWN_BIT_ALL))))

#define IS_GPIO_PH_OUTPUT_BIT(param)     (((param) & GPIO_PH_OUTPUT_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PH_OUTPUT_BIT_ALL))))

#define IS_GPIO_PH_FR1_BIT(param)        (((param) & GPIO_PH_FR1_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PH_FR1_BIT_ALL))))

#define IS_GPIO_PH_FR2_BIT(param)        (((param) & GPIO_PH_FR2_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PH_FR2_BIT_ALL))))

#define IS_GPIO_PH_FR3_BIT(param)        (((param) & GPIO_PH_FR3_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PH_FR3_BIT_ALL))))

#define IS_GPIO_PH_FR4_BIT(param)        (((param) & GPIO_PH_FR4_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PH_FR4_BIT_ALL))))

#define IS_GPIO_PH_FR5_BIT(param)        (((param) & GPIO_PH_FR5_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PH_FR5_BIT_ALL))))

#define IS_GPIO_PH_OPEN_DRAIN_BIT(param) (((param) & GPIO_PH_OPEN_DRAIN_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PH_OPEN_DRAIN_BIT_ALL))))

#define IS_GPIO_PH_PULLUP_BIT(param)     (((param) & GPIO_PH_PULLUP_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PH_PULLUP_BIT_ALL))))

#define IS_GPIO_PH_INPUT_BIT(param)      (((param) & GPIO_PH_INPUT_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PH_INPUT_BIT_ALL))))

#define IS_GPIO_PH_PULLDOWN_BIT(param)   (((param) & GPIO_PH_PULLDOWN_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PH_PULLDOWN_BIT_ALL))))

#define IS_GPIO_PI_OUTPUT_BIT(param)     (((param) & GPIO_PI_OUTPUT_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PI_OUTPUT_BIT_ALL))))

#define IS_GPIO_PI_FR1_BIT(param)        (((param) & GPIO_PI_FR1_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PI_FR1_BIT_ALL))))

#define IS_GPIO_PI_FR2_BIT(param)        (((param) & GPIO_PI_FR2_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PI_FR2_BIT_ALL))))

#define IS_GPIO_PI_OPEN_DRAIN_BIT(param) (((param) & GPIO_PI_OPEN_DRAIN_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PI_OPEN_DRAIN_BIT_ALL))))

#define IS_GPIO_PI_PULLUP_BIT(param)     (((param) & GPIO_PI_PULLUP_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PI_PULLUP_BIT_ALL))))

#define IS_GPIO_PI_INPUT_BIT(param)      (((param) & GPIO_PI_INPUT_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PI_INPUT_BIT_ALL))))

#define IS_GPIO_PI_PULLDOWN_BIT(param)   (((param) & GPIO_PI_PULLDOWN_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PI_PULLDOWN_BIT_ALL))))

#define IS_GPIO_PJ_OUTPUT_BIT(param)     (((param) & GPIO_PJ_OUTPUT_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PJ_OUTPUT_BIT_ALL))))

#define IS_GPIO_PJ_OPEN_DRAIN_BIT(param) (((param) & GPIO_PJ_OPEN_DRAIN_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PJ_OPEN_DRAIN_BIT_ALL))))

#define IS_GPIO_PJ_PULLUP_BIT(param)     (((param) & GPIO_PJ_PULLUP_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PJ_PULLUP_BIT_ALL))))

#define IS_GPIO_PJ_INPUT_BIT(param)      (((param) & GPIO_PJ_INPUT_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PJ_INPUT_BIT_ALL))))

#define IS_GPIO_PJ_PULLDOWN_BIT(param)   (((param) & GPIO_PJ_PULLDOWN_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PJ_PULLDOWN_BIT_ALL))))

#define IS_GPIO_PK_OUTPUT_BIT(param)     (((param) & GPIO_PK_OUTPUT_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PK_OUTPUT_BIT_ALL))))

#define IS_GPIO_PK_FR1_BIT(param)        (((param) & GPIO_PK_FR1_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PK_FR1_BIT_ALL))))

#define IS_GPIO_PK_FR2_BIT(param)        (((param) & GPIO_PK_FR2_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PK_FR2_BIT_ALL))))

#define IS_GPIO_PK_FR3_BIT(param)        (((param) & GPIO_PK_FR3_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PK_FR3_BIT_ALL))))

#define IS_GPIO_PK_FR4_BIT(param)        (((param) & GPIO_PK_FR4_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PK_FR4_BIT_ALL))))

#define IS_GPIO_PK_OPEN_DRAIN_BIT(param) (((param) & GPIO_PK_OPEN_DRAIN_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PK_OPEN_DRAIN_BIT_ALL))))

#define IS_GPIO_PK_PULLUP_BIT(param)     (((param) & GPIO_PK_PULLUP_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PK_PULLUP_BIT_ALL))))

#define IS_GPIO_PK_INPUT_BIT(param)      (((param) & GPIO_PK_INPUT_BIT_ALL)&& \
                                          (!((param) &(uint8_t) (~GPIO_PK_INPUT_BIT_ALL))))

